[Timeout] StringLiteral
pgats-ci-projeto-base-main/src/components/choose-ride.component.js:42:23
     return element;
   }
 }
-customElements.define('robo-choose-ride', ChooseRideComponent);
+customElements.define("", ChooseRideComponent);
 
