[Timeout] ArrayDeclaration
pgats-ci-projeto-base-main/src/components/ride.component.js:35:20
   /** @return {Person[]} */
   getPeople() {
     /** @type {Person[]} */
-    const people = [];
+    const people = ["Stryker was here"];
 
     const heightInputs = [...this.by.id.heightInputs.querySelectorAll('input')];

[Timeout] UpdateOperator
pgats-ci-projeto-base-main/src/components/ride.component.js:38:41
     const people = [];
 
     const heightInputs = [...this.by.id.heightInputs.querySelectorAll('input')];
-    for (let i = 0; i < this.numPeople; i++) {
+    for (let i = 0; i < this.numPeople; i--) {
       people.push({
         index: i + 1,

[Timeout] BlockStatement
pgats-ci-projeto-base-main/src/components/ride.component.js:55:30
   submit = (event) => {
     event.preventDefault();
     const people = this.getPeople();
-    if (this.ride.minHeight) {
-      const invalidHeights = people.filter(
-        ({ height }) => !this.hasValidHeight(height),
-      );
-      if (invalidHeights.length) {
-        this.by.id.alert.style.display = 'block';
-        this.by.id.alertText.innerHTML = `${invalidHeights.map(({ index }) => `Person ${index} is too short for this ride`).join('<br />')}`;
-        return;
-      }
-    }
+    if (this.ride.minHeight) {}
     orderService.currentOrder = { ride: this.ride, people };
     router.navigate(['success']);

[Timeout] StringLiteral
pgats-ci-projeto-base-main/src/components/ride.component.js:60:42
         ({ height }) => !this.hasValidHeight(height),
       );
       if (invalidHeights.length) {
-        this.by.id.alert.style.display = 'block';
+        this.by.id.alert.style.display = "";
         this.by.id.alertText.innerHTML = `${invalidHeights.map(({ index }) => `Person ${index} is too short for this ride`).join('<br />')}`;
         return;

[Timeout] StringLiteral
pgats-ci-projeto-base-main/src/components/ride.component.js:61:42
       );
       if (invalidHeights.length) {
         this.by.id.alert.style.display = 'block';
-        this.by.id.alertText.innerHTML = `${invalidHeights.map(({ index }) => `Person ${index} is too short for this ride`).join('<br />')}`;
+        this.by.id.alertText.innerHTML = ``;
         return;
       }

[Timeout] ObjectLiteral
pgats-ci-projeto-base-main/src/components/ride.component.js:65:33
         return;
       }
     }
-    orderService.currentOrder = { ride: this.ride, people };
+    orderService.currentOrder = {};
     router.navigate(['success']);
   };

[Timeout] StringLiteral
pgats-ci-projeto-base-main/src/components/ride.component.js:66:22
       }
     }
     orderService.currentOrder = { ride: this.ride, people };
-    router.navigate(['success']);
+    router.navigate([""]);
   };
 

[Timeout] BlockStatement
pgats-ci-projeto-base-main/src/components/ride.component.js:73:18
     this.appendChild(cloneTemplate(templateRidePage));
     const rideId = this.getAttribute('ride-id');
     rideService.getRide(rideId).then((ride) => {
-      if (!ride) {
-        router.navigate([]);
-      }
+      if (!ride) {}
       this.ride = ride;
       this.#render();

[Timeout] ArrayDeclaration
pgats-ci-projeto-base-main/src/components/ride.component.js:74:25
     const rideId = this.getAttribute('ride-id');
     rideService.getRide(rideId).then((ride) => {
       if (!ride) {
-        router.navigate([]);
+        router.navigate(["Stryker was here"]);
       }
       this.ride = ride;

[Timeout] EqualityOperator
pgats-ci-projeto-base-main/src/components/ride.component.js:87:12
 
   /** @param {number} height */
   hasValidHeight(height) {
-    return this.ride.minHeight < height;
+    return this.ride.minHeight <= height;
   }
 

[Timeout] StringLiteral
pgats-ci-projeto-base-main/src/components/ride.component.js:111:29
               row.class.colFormLabel
             );
             label.innerText = `Height for person ${index + 1}`;
-            label.htmlFor = `heightInput-${index}`;
+            label.htmlFor = ``;
             const input = /** @type {HTMLInputElement} */ (
               row.class.formControl

[Timeout] StringLiteral
pgats-ci-projeto-base-main/src/components/ride.component.js:123:23
     }
   }
 }
-customElements.define('robo-ride', RideComponent);
+customElements.define("", RideComponent);
 
