[Timeout] StringLiteral
pgats-ci-projeto-base-main/src/components/ride.template.js:58:65
   </div>
   </div>`;
 
-export const minimalRideHeightTemplate = document.createElement('template');
+export const minimalRideHeightTemplate = document.createElement("");
 minimalRideHeightTemplate.innerHTML = `<p class="lead">Minimum height: <span class="min-height"></span> cm</p>`;
 
