[Timeout] ObjectLiteral
pgats-ci-projeto-base-main/src/components/robo.component.js:25:7
     );
     this.id = new Proxy(
       {},
-      {
-        get: (_, property) =>
-          this.#element?.querySelector(`#${toKebabCase(String(property))}`),
-      },
+      {},
     );
   }

[Timeout] Regex
pgats-ci-projeto-base-main/src/components/robo.component.js:35:22
 
 /** @param {string} str */
 function toKebabCase(str) {
-  return str.replace(/([a-z0-9])([A-Z])/g, '$1-$2').toLowerCase();
+  return str.replace(/([a-z0-9])([^A-Z])/g, '$1-$2').toLowerCase();
 }
 
