[Timeout] StringLiteral
pgats-ci-projeto-base-main/src/pipes/rides-summary.pipe.js:7:16
  */
 export function ridesSummary(order) {
   let shortDescription = '';
-  let people = 'people';
+  let people = "";
   if (order.ride.minHeight) {
     shortDescription = ` (>= ${order.people.reduce((acc, person) => (acc.height < person.height ? acc : person)).height} cm)`;

[Timeout] ConditionalExpression
pgats-ci-projeto-base-main/src/pipes/rides-summary.pipe.js:9:70
   let shortDescription = '';
   let people = 'people';
   if (order.ride.minHeight) {
-    shortDescription = ` (>= ${order.people.reduce((acc, person) => (acc.height < person.height ? acc : person)).height} cm)`;
+    shortDescription = ` (>= ${order.people.reduce((acc, person) => (false ? acc : person)).height} cm)`;
   }
   if (order.people.length === 1) {

[Timeout] ConditionalExpression
pgats-ci-projeto-base-main/src/pipes/rides-summary.pipe.js:11:7
   if (order.ride.minHeight) {
     shortDescription = ` (>= ${order.people.reduce((acc, person) => (acc.height < person.height ? acc : person)).height} cm)`;
   }
-  if (order.people.length === 1) {
+  if (false) {
     people = 'person';
   }

[Timeout] StringLiteral
pgats-ci-projeto-base-main/src/pipes/rides-summary.pipe.js:14:10
   if (order.people.length === 1) {
     people = 'person';
   }
-  return `${order.people.length} ${people} ${shortDescription} for the ${order.ride.name}, have fun!`;
+  return ``;
 }
 
