[Timeout] StringLiteral
GitHUB/pgats-ci-projeto-base-main/src/router.js:31:49
     return this.#global.location.hash.substring(1).split('/');
   }
   set #currentRoute(route) {
-    this.#global.location.hash = `#${route.join('/')}`;
+    this.#global.location.hash = `#${route.join("")}`;
   }
 }
