[Timeout] StringLiteral
pgats-ci-projeto-base-main/src/services/ride.service.js:7:34
    * @returns {Promise<Ride[]>}
    */
   async getRides() {
-    const response = await fetch('api/rides.json');
+    const response = await fetch("");
     return response.json();
   }
